       IDENTIFICATION          DIVISION.
       PROGRAM-ID.             TEST1.
       PROCEDURE               DIVISION.
           MAIN-RTN   SECTION.
           DISPLAY "HELLO WORLD".