#! /bin/bash
#-----------------------------------------------------------------------------------------
# サブシステムＩＤ  ：  
# サブシステム名称  ：  
# モジュールＩＤ    ：  apfdC000_100RX
# モジュール名称    ：  共通翌日用更新フレーム
# 処理概要          ：  共通翌日用更新フレーム
# 引数              ：  ARG1  :  go
#                       ARG2  :  種別
# リターンコード    ：  0：正常終了
#                       1：異常終了
# 改訂履歴
# 年月日    区分    担当    内容
# --------  ----    ------  --------------------------------------
# 20110620  新規    GUT劉
# Copyright (C) 2011 by Nomura Research Institute,Ltd.
# All rights reserved.
#------------------------------------------------------------------------
# 環境設定
#------------------------------------------------------------------------
TMP_PEX_JOB=${SJ_PEX_JOB}
TS_RCODE=0
#------------------------------------------------------------------------
# 共通翌日用更新フレーム開始
#------------------------------------------------------------------------
echo "-----------------------------------------------------------------"          >> ${TS_LOGFILE}
echo "共通翌日用更新フレーム 開始              $(date '+%y/%m/%d %H:%M:%S:%N')"   >> ${TS_LOGFILE}
#------------------------------------------------------------------------
# ステップ-1  引数確認
#------------------------------------------------------------------------
if [ "$1" != "go" ];then
   echo "Argument1 Error $(date '+%y/%m/%d %H:%M:%S:%N')"                         >> ${TS_LOGFILE}
   sjANM_sendmsg -cTBAP001 -n${TMP_PEX_JOB} -lE -m共通翌日用更新フレームシェルエラー[step:1][rcode:${TS_RCODE}][${TS_LOGFILE}]  >> ${TS_LOGFILE} 2>&1
   TS_RCODE=1
   exit ${TS_RCODE}
fi
#------------------------------------------------------------------------
# ステップ-2  システム日付更新処理
#------------------------------------------------------------------------
export SJ_PEX_JOB=apjdDY02
sh apjdDY02.sh go                                                                 >> ${TS_LOGFILE}
if [ $? != 0 ];then
   TS_RCODE=1
   echo "システム日付更新処理 異常終了(Command) $(date '+%y/%m/%d %H:%M:%S:%N')"  >> ${TS_LOGFILE}
   sjANM_sendmsg -cTBAP001 -n${TMP_PEX_JOB} -lE -m共通翌日用更新フレームシェルエラー[step:2][rcode:${TS_RCODE}][${TS_LOGFILE}]  >> ${TS_LOGFILE} 2>&1
   exit ${TS_RCODE}
fi
#------------------------------------------------------------------------
# ステップ-3  起動ID管理初期化処理
#------------------------------------------------------------------------
export SJ_PEX_JOB=apjdDY11
sh apjdDY11.sh go                                                                 >> ${TS_LOGFILE}
if [ $? != 0 ];then
   TS_RCODE=1
   echo "起動ID管理初期化処理 異常終了(Command) $(date '+%y/%m/%d %H:%M:%S:%N')"  >> ${TS_LOGFILE}
   sjANM_sendmsg -cTBAP001 -n${TMP_PEX_JOB} -lE -m共通翌日用更新フレームシェルエラー[step:3][rcode:${TS_RCODE}][${TS_LOGFILE}]  >> ${TS_LOGFILE} 2>&1
   exit ${TS_RCODE}
fi
#------------------------------------------------------------------------
# ステップ-4  ﾀｽｸｽｹｼﾞｭｰﾙ自動起動
#------------------------------------------------------------------------
export SJ_PEX_JOB=NIB_apjdDY08
sh NIB_apjdDY08.sh go                                                             >> ${TS_LOGFILE}
if [ $? != 0 ];then
   TS_RCODE=1
   echo "ﾀｽｸｽｹｼﾞｭｰﾙ自動起動 異常終了(Command) $(date '+%y/%m/%d %H:%M:%S:%N')"    >> ${TS_LOGFILE}
   sjANM_sendmsg -cTBAP001 -n${TMP_PEX_JOB} -lE -m共通翌日用更新フレームシェルエラー[step:4][rcode:${TS_RCODE}][${TS_LOGFILE}]  >> ${TS_LOGFILE} 2>&1
   exit ${TS_RCODE}
fi
#------------------------------------------------------------------------
# 処理終了
#------------------------------------------------------------------------
echo "共通翌日用更新フレーム 正常終了          $(date '+%y/%m/%d %H:%M:%S:%N')" >> ${TS_LOGFILE}
exit ${TS_RCODE}
